In [1]:
import pandas as pd

In [10]:
#series is a column
values=[10,20,30,40,50]

s=pd.Series(values, index=['a','b','c','d','a'])

#Data Frame
df=pd.DataFrame({
    'name':['Mike', 'Bob', 'Alice'],
    'age':[30,34,50],
    'job':['Programmer', 'Clerk', 'Designer']
})
#use one colummn as index
df=df.set_index('name')

In [11]:
#accessing
df

       age         job
name
Mike    30  Programmer
Bob     34       Clerk
Alice   50    Designer

In [12]:
#lets access mike
df.loc['Mike']

age            30
job    Programmer
Name: Mike, dtype: object

In [14]:
df1=pd.DataFrame({
    'a':[1,2,3]
}, index=[0,1,2])
df2=pd.DataFrame({
    'a':[10,20,30]
}, index=[1,2,0])

#combine
df1+df2

    a
0  31
1  12
2  23

In [16]:
df.reset_index()

    name  age         job
0   Mike   30  Programmer
1    Bob   34       Clerk
2  Alice   50    Designer

In [22]:
#lets export to a csv file
df.to_csv('my_data.csv')

In [23]:
#importing a data frame
pd.read_csv('my_data.csv', index_col=0)

       age         job
name
Mike    30  Programmer
Bob     34       Clerk
Alice   50    Designer

In [24]:
#export to json
df.to_json('mydata.js')